DataProcessors/MRS_ПомощникЗакрытияСмены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>MRS_ПомощникЗакрытияСмены</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПЛ_СоответствиеСФронтСистемами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПЛ_СоответствиеСФронтСистемами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПЛ_ТипыОбъектовФронтСистем</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеВлияетНаУчетТМЦ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НоменклатураАлкоголь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмеренияАлкоголь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеКнопки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПЛ_ТипыОбъектовФронтСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФронтСистема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ТипыФронтСистем</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/MRS_ПомощникЗакрытияСмены/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Выполняется при открытии формы.
// Инициализирует страницу параметров: заполняет список складов.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Элементы.ГруппаОсновная.ТекущаяСтраница = Элементы.СтраницаПараметров;

	ЗаполнитьСкладыВыборНаСервере();
	ОбновитьВидимостьКомандФормы();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Обработчик активизации страницы в группе шагов.
// Пересчитывает статус текущего шага и обновляет содержимое таблиц на странице.
//
&НаКлиенте
Процедура ГруппаШаговПриАктивизации(Элемент)

	ОбновитьВидимостьКомандФормы();
	ОбновитьСтатусТекущегоШага();

КонецПроцедуры

// Сбрасывает рассчитанный рекомендуемый день при изменении выбора точки продаж.
//
&НаКлиенте
Процедура СкладыВыборОтмеченПриИзменении(Элемент)

	РекомендуемыйДень = Дата(1, 1, 1);

КонецПроцедуры

// Пересчитывает данные шага при смене текущего склада.
//
&НаКлиенте
Процедура ТекущийСкладПриИзменении(Элемент)

	ОбновитьСтатусТекущегоШага();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Команда «Начать работу» — фиксирует выбранные точки продаж и переходит к шагам.
//
&НаКлиенте
Процедура НачатьРаботу(Команда)

	Если НЕ ЗначениеЗаполнено(ВыбранныйДень) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Выберите день для работы.'"));
		Возврат;
	КонецЕсли;

	ТочкиПродаж = ПолучитьОтмеченныеТочкиПродаж();
	Если ТочкиПродаж.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Отметьте хотя бы одну точку продаж.'"));
		Возврат;
	КонецЕсли;

	МассивСкладов = ПолучитьСкладыИзТочекПродаж(ТочкиПродаж);
	Если МассивСкладов.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для выбранных точек продаж не заполнен склад.'"));
		Возврат;
	КонецЕсли;

	СохранитьВыбранныеТочкиПродажНаСервере(ТочкиПродаж);

	ДлительнаяОперация = РассчитатьРекомендуемыйДеньНаСервере(МассивСкладов);

	Если ДлительнаяОперация = Неопределено Тогда
		ПерейтиКШагамРаботы();
		Возврат;
	КонецЕсли;

	ОжидатьДлительнуюОперацию(
		ДлительнаяОперация,
		НСтр("ru = 'Расчет рекомендуемого дня...'"),
		"ПослеНачалаРаботы");

КонецПроцедуры

// Команда «Далее» — проверяет статус текущего шага и переходит к следующему.
//
&НаКлиенте
Процедура Далее(Команда)

	ТекущаяСтраница = Элементы.ГруппаШагов.ТекущаяСтраница.Имя;
	Статус = ПолучитьСтатусШагаПоСтраницеНаСервере(ТекущаяСтраница);

	Если Статус <> "Пройден" Тогда
		ПоказатьПредупреждение(,
			НСтр("ru = 'Текущий шаг не завершен. Выполните необходимые действия перед переходом дальше.'"));
		Возврат;
	КонецЕсли;

	Если ТекущаяСтраница = "СтраницаСопоставления" Тогда
		Элементы.ГруппаШагов.ТекущаяСтраница = Элементы.СтраницаСверка;
	ИначеЕсли ТекущаяСтраница = "СтраницаСверка" Тогда
		Элементы.ГруппаШагов.ТекущаяСтраница = Элементы.СтраницаФормирование;
	ИначеЕсли ТекущаяСтраница = "СтраницаФормирование" Тогда
		Элементы.ГруппаШагов.ТекущаяСтраница = Элементы.СтраницаОстатки;
	ИначеЕсли ТекущаяСтраница = "СтраницаОстатки" Тогда
		ОбновитьИндикациюГотовностиНаСервере();
	КонецЕсли;

	ОбновитьВидимостьТекущегоСклада();
	ОбновитьВидимостьКомандФормы();
	ОбновитьСтатусТекущегоШага();

КонецПроцедуры

// Команда «Назад» — возвращает к предыдущему шагу без проверки статуса.
//
&НаКлиенте
Процедура Назад(Команда)

	ТекущаяСтраница = Элементы.ГруппаШагов.ТекущаяСтраница.Имя;

	Если ТекущаяСтраница = "СтраницаСверка" Тогда
		Элементы.ГруппаШагов.ТекущаяСтраница = Элементы.СтраницаСопоставления;
	ИначеЕсли ТекущаяСтраница = "СтраницаФормирование" Тогда
		Элементы.ГруппаШагов.ТекущаяСтраница = Элементы.СтраницаСверка;
	ИначеЕсли ТекущаяСтраница = "СтраницаОстатки" Тогда
		Элементы.ГруппаШагов.ТекущаяСтраница = Элементы.СтраницаФормирование;
	КонецЕсли;

	ОбновитьВидимостьТекущегоСклада();
	ОбновитьВидимостьКомандФормы();
	ОбновитьСтатусТекущегоШага();

КонецПроцедуры

// Команда «Сопоставить» — сопоставляет выбранные объекты фронта с объектами 1С.
//
&НаКлиенте
Процедура Сопоставить(Команда)

	ДлительныеОперации = СопоставитьНаСервере();

	Если ДлительныеОперации.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Отметьте строки и укажите объект для сопоставления.'"));
		Возврат;
	КонецЕсли;

	ОжидатьДлительныеОперации(
		ДлительныеОперации,
		НСтр("ru = 'Обновление ссылок в загруженных чеках...'"),
		"ПослеСопоставления");

КонецПроцедуры

// Команда «(Пере)загрузить чеки за день» — запускает фоновую перезагрузку чеков.
//
&НаКлиенте
Процедура ПерезагрузитьЧекиЗаДень(Команда)

	ДлительнаяОперация = ПерезагрузитьЧекиЗаДеньНаСервере();

	ОжидатьДлительнуюОперацию(
		ДлительнаяОперация,
		НСтр("ru = 'Перезагрузка чеков за выбранный день...'"),
		"ПослеПерезагрузкиЧеков");

КонецПроцедуры

// Команда «Переформировать выпуска» — запускает фоновое формирование целевых документов.
//
&НаКлиенте
Процедура ПереформироватьВыпуска(Команда)

	ДлительнаяОперация = ПереформироватьВыпускаНаСервере();

	ОжидатьДлительнуюОперацию(
		ДлительнаяОперация,
		НСтр("ru = 'Формирование целевых документов...'"),
		"ПослеПереформированияВыпусков");

КонецПроцедуры

// Команда «Открыть документ выпуска» — открывает сформированный документ.
//
&НаКлиенте
Процедура ОткрытьДокументВыпуска(Команда)

	ДокументВыпуска = ПолучитьДокументВыпускаНаСервере();

	Если НЕ ЗначениеЗаполнено(ДокументВыпуска) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Документ выпуска не найден. Сначала выполните переформирование.'"));
		Возврат;
	КонецЕсли;

	ПоказатьЗначение(, ДокументВыпуска);

КонецПроцедуры

// Команда «Выбрать другой день» — возвращает на страницу выбора параметров.
//
&НаКлиенте
Процедура ВыбратьДругойДень(Команда)

	Элементы.ГруппаОсновная.ТекущаяСтраница = Элементы.СтраницаПараметров;
	ОбновитьВидимостьКомандФормы();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет таблицу выбора точек продаж на сервере.
//
&НаСервере
Процедура ЗаполнитьСкладыВыборНаСервере()

	СкладыВыбор.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КассыККМ.питКассовыйУзел.СкладПриготовления КАК Склад,
	|	КассыККМ.Ссылка КАК КассаККМ,
	|	Соответствие.ФронтСистема КАК ФронтСистема,
	|	Соответствие.Код КАК КодТочкиПродаж,
	|	Соответствие.НаименованиеКнопки КАК НаименованиеТочкиПродаж
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПЛ_СоответствиеСФронтСистемами КАК Соответствие
	|		ПО КассыККМ.Ссылка = Соответствие.Объект
	|ГДЕ
	|	НЕ КассыККМ.ПометкаУдаления
	|	И Соответствие.ТипОбъекта = &ТипКасса
	|	И Соответствие.ФронтСистема В (&ФронтСистемы)
	|	И Соответствие.Код <> """"
	|	И КассыККМ.питКассовыйУзел.СкладПриготовления
	|		<> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|УПОРЯДОЧИТЬ ПО
	|	Склад,
	|	ФронтСистема,
	|	КодТочкиПродаж";

	ФронтСистемы = Новый Массив;
	ФронтСистемы.Добавить(Перечисления.ПЛ_ТипыФронтСистем.TNG);
	ФронтСистемы.Добавить(Перечисления.ПЛ_ТипыФронтСистем.Micros);

	Запрос.УстановитьПараметр("ТипКасса", ПланыВидовХарактеристик.ПЛ_ТипыОбъектовФронтСистем.КассаККМ);
	Запрос.УстановитьПараметр("ФронтСистемы", ФронтСистемы);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СкладыВыбор.Добавить();
		НоваяСтрока.Склад                  = Выборка.Склад;
		НоваяСтрока.КассаККМ               = Выборка.КассаККМ;
		НоваяСтрока.ФронтСистема           = Выборка.ФронтСистема;
		НоваяСтрока.КодТочкиПродаж         = Выборка.КодТочкиПродаж;
		НоваяСтрока.НаименованиеТочкиПродаж = Выборка.НаименованиеТочкиПродаж;
		НоваяСтрока.Отмечен                = Ложь;
	КонецЦикла;

КонецПроцедуры

// Возвращает массив отмеченных точек продаж из таблицы выбора.
//
&НаКлиенте
Функция ПолучитьОтмеченныеТочкиПродаж()

	Массив = Новый Массив;

	Для Каждого Строка Из СкладыВыбор Цикл
		Если Строка.Отмечен Тогда
			ТочкаПродаж = Новый Структура;
			ТочкаПродаж.Вставить("Склад", Строка.Склад);
			ТочкаПродаж.Вставить("КассаККМ", Строка.КассаККМ);
			ТочкаПродаж.Вставить("ФронтСистема", Строка.ФронтСистема);
			ТочкаПродаж.Вставить("КодТочкиПродаж", Строка.КодТочкиПродаж);
			ТочкаПродаж.Вставить("НаименованиеТочкиПродаж", Строка.НаименованиеТочкиПродаж);
			Массив.Добавить(ТочкаПродаж);
		КонецЕсли;
	КонецЦикла;

	Возврат Массив;

КонецФункции

// Возвращает уникальные склады по отмеченным точкам продаж.
//
&НаКлиенте
Функция ПолучитьСкладыИзТочекПродаж(ТочкиПродаж)

	МассивСкладов = Новый Массив;
	ИндексСкладов = Новый Соответствие;

	Для Каждого ТочкаПродаж Из ТочкиПродаж Цикл

		Склад = ТочкаПродаж.Склад;
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			Продолжить;
		КонецЕсли;

		Если ИндексСкладов.Получить(Склад) = Неопределено Тогда
			ИндексСкладов.Вставить(Склад, Истина);
			МассивСкладов.Добавить(Склад);
		КонецЕсли;

	КонецЦикла;

	Возврат МассивСкладов;

КонецФункции

// Сохраняет выбранные точки продаж сессии в реквизит формы.
//
&НаСервере
Процедура СохранитьВыбранныеТочкиПродажНаСервере(Знач ТочкиПродаж)

	МассивСкладовСессии.Очистить();

	Для Каждого ТочкаПродаж Из ТочкиПродаж Цикл
		НоваяСтрока = МассивСкладовСессии.Добавить();
		НоваяСтрока.Склад                  = ТочкаПродаж.Склад;
		НоваяСтрока.КассаККМ               = ТочкаПродаж.КассаККМ;
		НоваяСтрока.ФронтСистема           = ТочкаПродаж.ФронтСистема;
		НоваяСтрока.КодТочкиПродаж         = ТочкаПродаж.КодТочкиПродаж;
		НоваяСтрока.НаименованиеТочкиПродаж = ТочкаПродаж.НаименованиеТочкиПродаж;
	КонецЦикла;

	Если МассивСкладовСессии.Количество() > 0 Тогда
		ТекущийСклад = МассивСкладовСессии[0].Склад;
	Иначе
		ТекущийСклад = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Инициализирует таблицу статусов шагов.
//
&НаСервере
Процедура ИнициализироватьСтатусыШаговНаСервере()

	СтатусыШагов.Очистить();

	НоваяСтрока = СтатусыШагов.Добавить();
	НоваяСтрока.Номер = 1;
	НоваяСтрока.Наименование = НСтр("ru = 'Сопоставление объектов фронта'");
	НоваяСтрока.Статус = "";

	НоваяСтрока = СтатусыШагов.Добавить();
	НоваяСтрока.Номер = 2;
	НоваяСтрока.Наименование = НСтр("ru = 'Сверка чеков'");
	НоваяСтрока.Статус = "";

	НоваяСтрока = СтатусыШагов.Добавить();
	НоваяСтрока.Номер = 3;
	НоваяСтрока.Наименование = НСтр("ru = 'Формирование целевых документов'");
	НоваяСтрока.Статус = "";

	НоваяСтрока = СтатусыШагов.Добавить();
	НоваяСтрока.Номер = 4;
	НоваяСтрока.Наименование = НСтр("ru = 'Анализ отрицательных остатков'");
	НоваяСтрока.Статус = "";

КонецПроцедуры

// Обновляет статус текущего шага и данные на активной странице.
//
&НаКлиенте
Процедура ОбновитьСтатусТекущегоШага()

	ТекущаяСтраница = Элементы.ГруппаШагов.ТекущаяСтраница.Имя;
	ДлительнаяОперация = ОбновитьСтатусТекущегоШагаВФонеНаСервере(ТекущаяСтраница);

	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ОжидатьДлительнуюОперацию(
		ДлительнаяОперация,
		НСтр("ru = 'Обновление статуса шага...'"),
		"ПослеОбновленияСтатусаТекущегоШага");

КонецПроцедуры

// Запускает фоновое обновление статуса текущего шага.
//
&НаСервере
Функция ОбновитьСтатусТекущегоШагаВФонеНаСервере(ТекущаяСтраница)

	МассивСкладов = ПолучитьМассивСкладовСессии();
	УстановитьТекущийСкладПоУмолчанию(МассивСкладов);

	АдресРезультатаСтатуса = ПоместитьВоВременноеХранилище(Новый Структура, УникальныйИдентификатор);

	ПараметрыСтатуса = Новый Структура;
	ПараметрыСтатуса.Вставить("ТекущаяСтраница", ТекущаяСтраница);
	ПараметрыСтатуса.Вставить("ВыбранныйДень", ВыбранныйДень);
	ПараметрыСтатуса.Вставить("МассивСкладов", МассивСкладов);
	ПараметрыСтатуса.Вставить("ТекущийСклад", ТекущийСклад);
	ПараметрыСтатуса.Вставить("ПараметрыКасс", ПолучитьПараметрыКассСессии());

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление статуса шага...'");

	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"MRS_ПомощникЗакрытияСменыСервер.СтатусШагаВФоне",
		ПараметрыСтатуса,
		АдресРезультатаСтатуса);

КонецФункции

// Запускает фоновый пересчет рекомендуемого дня.
//
&НаКлиенте
Процедура ОбновитьРекомендуемыйДеньНаКлиенте()

	ТочкиПродаж = ПолучитьОтмеченныеТочкиПродаж();
	МассивСкладов = ПолучитьСкладыИзТочекПродаж(ТочкиПродаж);

	Если МассивСкладов.Количество() = 0 Тогда
		РекомендуемыйДень = Дата(1, 1, 1);
		Возврат;
	КонецЕсли;

	ДлительнаяОперация = РассчитатьРекомендуемыйДеньНаСервере(МассивСкладов);

	ОжидатьДлительнуюОперацию(
		ДлительнаяОперация,
		НСтр("ru = 'Расчет рекомендуемого дня...'"),
		"ПослеРасчетаРекомендуемогоДня");

КонецПроцедуры

// Возвращает текущий статус шага по имени страницы.
//
&НаСервере
Функция ПолучитьСтатусШагаПоСтраницеНаСервере(ТекущаяСтраница)

	Номер = 0;

	Если ТекущаяСтраница = "СтраницаСопоставления" Тогда
		Номер = 1;
	ИначеЕсли ТекущаяСтраница = "СтраницаСверка" Тогда
		Номер = 2;
	ИначеЕсли ТекущаяСтраница = "СтраницаФормирование" Тогда
		Номер = 3;
	ИначеЕсли ТекущаяСтраница = "СтраницаОстатки" Тогда
		Номер = 4;
	КонецЕсли;

	Для Каждого Строка Из СтатусыШагов Цикл
		Если Строка.Номер = Номер Тогда
			Возврат Строка.Статус;
		КонецЕсли;
	КонецЦикла;

	Возврат "";

КонецФункции

// Вычисляет и обновляет статус шага «Сопоставление объектов фронта».
//
&НаСервере
Процедура ОбновитьСтатусСопоставленияНаСервере()

	МассивСкладов = ПолучитьМассивСкладовСессии();
	Результат = MRS_ПомощникЗакрытияСменыСервер.СтатусШагаСопоставление(ВыбранныйДень, МассивСкладов);

	Для Каждого СтрокаСтатуса Из СтатусыШагов Цикл
		Если СтрокаСтатуса.Номер = 1 Тогда
			СтрокаСтатуса.Статус = Результат.Статус;
		КонецЕсли;
	КонецЦикла;

	НесопоставленныеОбъекты.Очистить();

	Для Каждого Строка Из Результат.Строки Цикл
		Новая = НесопоставленныеОбъекты.Добавить();
		Новая.ТипОбъекта           = Строка.ТипОбъекта;
		Новая.ФронтСистема         = Строка.ФронтСистема;
		Новая.Код                  = Строка.Код;
		Новая.НаименованиеНаФронте = Строка.НаименованиеНаФронте;
		Новая.Отмечен              = Ложь;
	КонецЦикла;

КонецПроцедуры

// Вычисляет и обновляет статус шага «Сверка чеков».
//
&НаСервере
Процедура ОбновитьСтатусСверкиНаСервере()

	МассивСкладов = ПолучитьМассивСкладовСессии();
	ПараметрыКасс = ПолучитьПараметрыКассСессии();
	Результат = MRS_ПомощникЗакрытияСменыСервер.СтатусШагаСверка(
		ВыбранныйДень,
		МассивСкладов,
		ПараметрыКасс);

	Для Каждого СтрокаСтатуса Из СтатусыШагов Цикл
		Если СтрокаСтатуса.Номер = 2 Тогда
			СтрокаСтатуса.Статус = Результат.Статус;
		КонецЕсли;
	КонецЦикла;

	ОтклоненияСверки.Очистить();

	Для Каждого Строка Из Результат.Строки Цикл
		Новая = ОтклоненияСверки.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Строка);
	КонецЦикла;

КонецПроцедуры

// Вычисляет и обновляет статус шага «Формирование целевых документов».
//
&НаСервере
Функция ОбновитьСтатусФормированияНаСервере()

	МассивСкладов = ПолучитьМассивСкладовСессии();
	УстановитьТекущийСкладПоУмолчанию(МассивСкладов);
	ПараметрыКасс = ПолучитьПараметрыКассСессии();

	Результат = MRS_ПомощникЗакрытияСменыСервер.СтатусШагаФормирование(
		ВыбранныйДень,
		ТекущийСклад,
		ПараметрыКасс);
	ОбщийСтатус = ПолучитьОбщийСтатусПоСкладам(МассивСкладов, "Формирование", ПараметрыКасс);

	Для Каждого СтрокаСтатуса Из СтатусыШагов Цикл
		Если СтрокаСтатуса.Номер = 3 Тогда
			СтрокаСтатуса.Статус = ОбщийСтатус;
		КонецЕсли;
	КонецЦикла;

	ОтклоненияВыпуска.Очистить();

	Для Каждого Строка Из Результат.ОтклоненияВыпуска Цикл
		Новая = ОтклоненияВыпуска.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Строка);
	КонецЦикла;

	ОшибкиФормирования.Очистить();

	Для Каждого Строка Из Результат.ОшибкиФормирования Цикл
		Новая = ОшибкиФормирования.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Строка);
	КонецЦикла;

	ДокументыОткрытыеЦены.Очистить();

	Для Каждого Строка Из Результат.ДокументыОткрытыеЦены Цикл
		Новая = ДокументыОткрытыеЦены.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Строка);
	КонецЦикла;

	Возврат Результат.НуженДиалогАктуальности;

КонецФункции

// Вычисляет и обновляет статус шага «Анализ отрицательных остатков».
//
&НаСервере
Процедура ОбновитьСтатусОстатковНаСервере()

	МассивСкладов = ПолучитьМассивСкладовСессии();
	УстановитьТекущийСкладПоУмолчанию(МассивСкладов);

	Результат = MRS_ПомощникЗакрытияСменыСервер.СтатусШагаОстатки(ВыбранныйДень, ТекущийСклад);
	ОбщийСтатус = ПолучитьОбщийСтатусПоСкладам(МассивСкладов, "Остатки");

	Для Каждого СтрокаСтатуса Из СтатусыШагов Цикл
		Если СтрокаСтатуса.Номер = 4 Тогда
			СтрокаСтатуса.Статус = ОбщийСтатус;
		КонецЕсли;
	КонецЦикла;

	ОтрицательныеОстатки.Очистить();

	Для Каждого Строка Из Результат.Строки Цикл
		Новая = ОтрицательныеОстатки.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Строка);
	КонецЦикла;

КонецПроцедуры

// Применяет результат фонового расчета статуса шага к данным формы.
//
&НаСервере
Функция ПрименитьРезультатСтатусаНаСервере()

	Если НЕ ЗначениеЗаполнено(АдресРезультатаСтатуса) Тогда
		Возврат Ложь;
	КонецЕсли;

	РезультатСтатуса = ПолучитьИзВременногоХранилища(АдресРезультатаСтатуса);

	Если ТипЗнч(РезультатСтатуса) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;

	Если НЕ РезультатСтатуса.Свойство("ТекущаяСтраница")
		ИЛИ НЕ РезультатСтатуса.Свойство("Результат") Тогда
		Возврат Ложь;
	КонецЕсли;

	ТекущаяСтраница = РезультатСтатуса.ТекущаяСтраница;
	Результат = РезультатСтатуса.Результат;

	Если ТекущаяСтраница = "СтраницаСопоставления" Тогда
		ПрименитьРезультатСопоставления(Результат);
	ИначеЕсли ТекущаяСтраница = "СтраницаСверка" Тогда
		ПрименитьРезультатСверки(Результат);
	ИначеЕсли ТекущаяСтраница = "СтраницаФормирование" Тогда
		Возврат ПрименитьРезультатФормирования(Результат, РезультатСтатуса);
	ИначеЕсли ТекущаяСтраница = "СтраницаОстатки" Тогда
		ПрименитьРезультатОстатков(Результат, РезультатСтатуса);
	КонецЕсли;

	Возврат Ложь;

КонецФункции

// Применяет данные шага сопоставления к таблицам формы.
//
&НаСервере
Процедура ПрименитьРезультатСопоставления(Результат)

	Для Каждого СтрокаСтатуса Из СтатусыШагов Цикл
		Если СтрокаСтатуса.Номер = 1 Тогда
			СтрокаСтатуса.Статус = Результат.Статус;
		КонецЕсли;
	КонецЦикла;

	НесопоставленныеОбъекты.Очистить();

	Для Каждого Строка Из Результат.Строки Цикл
		Новая = НесопоставленныеОбъекты.Добавить();
		Новая.ТипОбъекта           = Строка.ТипОбъекта;
		Новая.ФронтСистема         = Строка.ФронтСистема;
		Новая.Код                  = Строка.Код;
		Новая.НаименованиеНаФронте = Строка.НаименованиеНаФронте;
		Новая.Отмечен              = Ложь;
	КонецЦикла;

КонецПроцедуры

// Применяет данные шага сверки к таблицам формы.
//
&НаСервере
Процедура ПрименитьРезультатСверки(Результат)

	Для Каждого СтрокаСтатуса Из СтатусыШагов Цикл
		Если СтрокаСтатуса.Номер = 2 Тогда
			СтрокаСтатуса.Статус = Результат.Статус;
		КонецЕсли;
	КонецЦикла;

	ОтклоненияСверки.Очистить();

	Для Каждого Строка Из Результат.Строки Цикл
		Новая = ОтклоненияСверки.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Строка);
	КонецЦикла;

КонецПроцедуры

// Применяет данные шага формирования к таблицам формы.
//
&НаСервере
Функция ПрименитьРезультатФормирования(Результат, РезультатСтатуса)

	ОбщийСтатус = Результат.Статус;
	Если РезультатСтатуса.Свойство("ОбщийСтатус") Тогда
		ОбщийСтатус = РезультатСтатуса.ОбщийСтатус;
	КонецЕсли;

	Для Каждого СтрокаСтатуса Из СтатусыШагов Цикл
		Если СтрокаСтатуса.Номер = 3 Тогда
			СтрокаСтатуса.Статус = ОбщийСтатус;
		КонецЕсли;
	КонецЦикла;

	ОтклоненияВыпуска.Очистить();

	Для Каждого Строка Из Результат.ОтклоненияВыпуска Цикл
		Новая = ОтклоненияВыпуска.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Строка);
	КонецЦикла;

	ОшибкиФормирования.Очистить();

	Для Каждого Строка Из Результат.ОшибкиФормирования Цикл
		Новая = ОшибкиФормирования.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Строка);
	КонецЦикла;

	ДокументыОткрытыеЦены.Очистить();

	Для Каждого Строка Из Результат.ДокументыОткрытыеЦены Цикл
		Новая = ДокументыОткрытыеЦены.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Строка);
	КонецЦикла;

	Возврат Результат.НуженДиалогАктуальности;

КонецФункции

// Применяет данные шага остатков к таблицам формы.
//
&НаСервере
Процедура ПрименитьРезультатОстатков(Результат, РезультатСтатуса)

	ОбщийСтатус = Результат.Статус;
	Если РезультатСтатуса.Свойство("ОбщийСтатус") Тогда
		ОбщийСтатус = РезультатСтатуса.ОбщийСтатус;
	КонецЕсли;

	Для Каждого СтрокаСтатуса Из СтатусыШагов Цикл
		Если СтрокаСтатуса.Номер = 4 Тогда
			СтрокаСтатуса.Статус = ОбщийСтатус;
		КонецЕсли;
	КонецЦикла;

	ОтрицательныеОстатки.Очистить();

	Для Каждого Строка Из Результат.Строки Цикл
		Новая = ОтрицательныеОстатки.Добавить();
		ЗаполнитьЗначенияСвойств(Новая, Строка);
	КонецЦикла;

КонецПроцедуры

// Показывает диалог подтверждения пересоздания выпусков.
//
&НаКлиенте
Процедура ПоказатьДиалогАктуальности()

	ТекстВопроса = НСтр("ru = 'Рекомендуется пересоздание выпусков блюд для обновления. Выполнить сейчас?'");
	Оповещение = Новый ОписаниеОповещения("ПослеДиалогаАктуальности", ЭтотОбъект);

	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);

КонецПроцедуры

// Обработчик результата диалога актуальности.
//
&НаКлиенте
Процедура ПослеДиалогаАктуальности(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ПереформироватьВыпуска(Неопределено);
	КонецЕсли;

КонецПроцедуры

// Запускает фоновую перезагрузку чеков через БСП ДлительныеОперации.
//
&НаСервере
Функция ПерезагрузитьЧекиЗаДеньНаСервере()

	ПараметрыКасс = ПолучитьПараметрыКассСессии();

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Перезагрузка чеков за выбранный день...'");

	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"MRS_ПомощникЗакрытияСменыСервер.ПерезагрузитьЧекиЗаДень",
		ВыбранныйДень,
		ПараметрыКасс);

КонецФункции

// Запускает фоновое формирование целевых документов через БСП ДлительныеОперации.
//
&НаСервере
Функция ПереформироватьВыпускаНаСервере()

	МассивСкладов = ПолучитьМассивСкладовСессии();
	УстановитьТекущийСкладПоУмолчанию(МассивСкладов);

	Если НЕ ЗначениеЗаполнено(ТекущийСклад) Тогда
		Возврат Неопределено;
	КонецЕсли;

	АдресРезультатаФормирования = ПоместитьВоВременноеХранилище(Новый Структура, УникальныйИдентификатор);

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Формирование целевых документов...'");

	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"MRS_ПомощникЗакрытияСменыСервер.СформироватьЦелевыеДокументы",
		ВыбранныйДень,
		ТекущийСклад,
		АдресРезультатаФормирования);

КонецФункции

// Запускает фоновый расчет рекомендуемого дня.
//
&НаСервере
Функция РассчитатьРекомендуемыйДеньНаСервере(Знач МассивСкладов)

	АдресРезультатаРекомендуемогоДня = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ПараметрыКасс = ПолучитьПараметрыКассСессии();

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Расчет рекомендуемого дня...'");

	Возврат ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения,
		"MRS_ПомощникЗакрытияСменыСервер.РекомендуемыйДеньВФоне",
		МассивСкладов,
		ПараметрыКасс,
		АдресРезультатаРекомендуемогоДня);

КонецФункции

// Сопоставляет объекты и запускает пропагацию ссылок в фоне.
//
&НаСервере
Функция СопоставитьНаСервере()

	МассивДлительныхОпераций = Новый Массив;
	ФронтСистемы = Новый Соответствие;

	Для Каждого Строка Из НесопоставленныеОбъекты Цикл

		Если НЕ Строка.Отмечен ИЛИ НЕ ЗначениеЗаполнено(Строка.ОбъектДляСопоставления) Тогда
			Продолжить;
		КонецЕсли;

		MRS_ПомощникЗакрытияСменыСервер.СопоставитьОбъектФронта(
			Строка.ТипОбъекта,
			Строка.ФронтСистема,
			Строка.Код,
			Строка.ОбъектДляСопоставления);

		Если ФронтСистемы.Получить(Строка.ФронтСистема) = Неопределено Тогда
			ФронтСистемы.Вставить(Строка.ФронтСистема, Истина);
		КонецЕсли;

	КонецЦикла;

	Для Каждого КлючЗначение Из ФронтСистемы Цикл

		ФронтСистема = КлючЗначение.Ключ;
		АдресРезультата = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);

		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление ссылок в загруженных чеках...'");

		ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
			ПараметрыВыполнения,
			"РегистрыСведений.ПЛ_СоответствиеСФронтСистемами.ЗаполнитьСсылкиПоКодамПослеЗагрузки",
			Новый Структура("ФронтСистема", ФронтСистема),
			АдресРезультата);

		МассивДлительныхОпераций.Добавить(ДлительнаяОперация);

	КонецЦикла;

	Возврат МассивДлительныхОпераций;

КонецФункции

// Возвращает документ выпуска из временного хранилища.
//
&НаСервере
Функция ПолучитьДокументВыпускаНаСервере()

	Если НЕ ЗначениеЗаполнено(АдресРезультатаФормирования) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Результат = ПолучитьИзВременногоХранилища(АдресРезультатаФормирования);

	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("ДокументВыпуска") Тогда
		Возврат Результат.ДокументВыпуска;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Обновляет индикацию готовности к продвижению даты запрета.
//
&НаСервере
Процедура ОбновитьИндикациюГотовностиНаСервере()

	МассивСкладов = ПолучитьМассивСкладовСессии();
	ВсеПройдены = Истина;

	Для Каждого СтрокаСтатуса Из СтатусыШагов Цикл
		Если СтрокаСтатуса.Статус <> "Пройден" Тогда
			ВсеПройдены = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Если ВсеПройдены Тогда
		ПараметрыКасс = ПолучитьПараметрыКассСессии();

		Для Каждого Склад Из МассивСкладов Цикл
			СтатусФормирования = MRS_ПомощникЗакрытияСменыСервер.СтатусШагаФормирование(
				ВыбранныйДень,
				Склад,
				ПараметрыКасс);
			Если СтатусФормирования.Статус <> "Пройден" Тогда
				ВсеПройдены = Ложь;
				Прервать;
			КонецЕсли;

			СтатусОстатки = MRS_ПомощникЗакрытияСменыСервер.СтатусШагаОстатки(ВыбранныйДень, Склад);
			Если СтатусОстатки.Статус <> "Пройден" Тогда
				ВсеПройдены = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если ВсеПройдены Тогда
		НадписьГотовность = НСтр("ru = 'День чист по выбранным складам. Дату запрета редактирования можно продвигать.'");
	Иначе
		НадписьГотовность = "";
	КонецЕсли;

КонецПроцедуры

// Возвращает массив складов, выбранных в текущей сессии.
//
&НаСервере
Функция ПолучитьМассивСкладовСессии()

	Массив = Новый Массив;
	ИндексСкладов = Новый Соответствие;

	Для Каждого Строка Из МассивСкладовСессии Цикл
		Если ЗначениеЗаполнено(Строка.Склад) И ИндексСкладов.Получить(Строка.Склад) = Неопределено Тогда
			ИндексСкладов.Вставить(Строка.Склад, Истина);
			Массив.Добавить(Строка.Склад);
		КонецЕсли;
	КонецЦикла;

	Если Массив.Количество() = 0 Тогда
		Для Каждого Строка Из СкладыВыбор Цикл
			Если Строка.Отмечен
				И ЗначениеЗаполнено(Строка.Склад)
				И ИндексСкладов.Получить(Строка.Склад) = Неопределено Тогда

				ИндексСкладов.Вставить(Строка.Склад, Истина);
				Массив.Добавить(Строка.Склад);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если Массив.Количество() = 0 И ЗначениеЗаполнено(ТекущийСклад) Тогда
		Массив.Добавить(ТекущийСклад);
	КонецЕсли;

	Возврат Массив;

КонецФункции

// Возвращает параметры касс по выбранным точкам продаж текущей сессии.
//
&НаСервере
Функция ПолучитьПараметрыКассСессии()

	ПараметрыКасс = НоваяТаблицаПараметровКасс();

	Для Каждого Строка Из МассивСкладовСессии Цикл
		ДобавитьСтрокуПараметровКасс(ПараметрыКасс, Строка);
	КонецЦикла;

	Если ПараметрыКасс.Количество() = 0 Тогда
		Для Каждого Строка Из СкладыВыбор Цикл
			Если Строка.Отмечен Тогда
				ДобавитьСтрокуПараметровКасс(ПараметрыКасс, Строка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат ПараметрыКасс;

КонецФункции

// Создает таблицу параметров касс в формате обработки MRS_ЗагрузкаДанныхИзФронтСистем.
//
&НаСервере
Функция НоваяТаблицаПараметровКасс()

	ПараметрыКасс = Новый ТаблицаЗначений;
	ПараметрыКасс.Колонки.Добавить("Использовать", Новый ОписаниеТипов("Булево"));
	ПараметрыКасс.Колонки.Добавить("КассаККМ", Новый ОписаниеТипов("СправочникСсылка.КассыККМ"));
	ПараметрыКасс.Колонки.Добавить("ФронтСистема", Новый ОписаниеТипов("ПеречислениеСсылка.ПЛ_ТипыФронтСистем"));
	ПараметрыКасс.Колонки.Добавить("КодТочкиПродаж", Новый ОписаниеТипов("Строка"));
	ПараметрыКасс.Колонки.Добавить("НаименованиеТочкиПродаж", Новый ОписаниеТипов("Строка"));

	Возврат ПараметрыКасс;

КонецФункции

// Добавляет выбранную точку продаж в таблицу параметров касс.
//
&НаСервере
Процедура ДобавитьСтрокуПараметровКасс(ПараметрыКасс, СтрокаИсточник)

	Если НЕ ЗначениеЗаполнено(СтрокаИсточник.КодТочкиПродаж) Тогда
		Возврат;
	КонецЕсли;

	НоваяСтрока = ПараметрыКасс.Добавить();
	НоваяСтрока.Использовать             = Истина;
	НоваяСтрока.КассаККМ                 = СтрокаИсточник.КассаККМ;
	НоваяСтрока.ФронтСистема             = СтрокаИсточник.ФронтСистема;
	НоваяСтрока.КодТочкиПродаж           = СтрокаИсточник.КодТочкиПродаж;
	НоваяСтрока.НаименованиеТочкиПродаж  = СтрокаИсточник.НаименованиеТочкиПродаж;

КонецПроцедуры

// Устанавливает текущий склад, если он не выбран.
//
&НаСервере
Процедура УстановитьТекущийСкладПоУмолчанию(МассивСкладов)

	Если НЕ ЗначениеЗаполнено(ТекущийСклад) И МассивСкладов.Количество() > 0 Тогда
		ТекущийСклад = МассивСкладов[0];
	КонецЕсли;

КонецПроцедуры

// Возвращает агрегированный статус складо-специфичного шага.
//
&НаСервере
Функция ПолучитьОбщийСтатусПоСкладам(МассивСкладов, ИмяШага, ПараметрыКасс = Неопределено)

	ОбщийСтатус = "Пройден";

	Для Каждого Склад Из МассивСкладов Цикл

		Если ИмяШага = "Формирование" Тогда
			Результат = MRS_ПомощникЗакрытияСменыСервер.СтатусШагаФормирование(
				ВыбранныйДень,
				Склад,
				ПараметрыКасс);
		Иначе
			Результат = MRS_ПомощникЗакрытияСменыСервер.СтатусШагаОстатки(ВыбранныйДень, Склад);
		КонецЕсли;

		Если Результат.Статус <> "Пройден" Тогда
			ОбщийСтатус = "НеПройден";
			Прервать;
		КонецЕсли;

	КонецЦикла;

	Возврат ОбщийСтатус;

КонецФункции

// Управляет видимостью поля выбора склада на шагах 3/4.
//
&НаКлиенте
Процедура ОбновитьВидимостьТекущегоСклада()

	МассивСкладов = ПолучитьМассивСкладовСессииНаКлиенте();
	НесколькоСкладов = МассивСкладов.Количество() > 1;

	Элементы.ТекущийСклад.Видимость = НесколькоСкладов
		И (Элементы.ГруппаШагов.ТекущаяСтраница = Элементы.СтраницаФормирование
			ИЛИ Элементы.ГруппаШагов.ТекущаяСтраница = Элементы.СтраницаОстатки);

КонецПроцедуры

// Управляет видимостью команд формы по текущему этапу помощника.
//
&НаКлиенте
Процедура ОбновитьВидимостьКомандФормы()

	СтраницаПараметровАктивна = Элементы.ГруппаОсновная.ТекущаяСтраница = Элементы.СтраницаПараметров;
	СтраницаШаговАктивна = НЕ СтраницаПараметровАктивна;
	ТекущаяСтраницаШага = Элементы.ГруппаШагов.ТекущаяСтраница;

	Элементы.НачатьРаботу.Видимость = СтраницаПараметровАктивна;
	Элементы.ФормаНазад.Видимость = СтраницаШаговАктивна
		И ТекущаяСтраницаШага <> Элементы.СтраницаСопоставления;
	Элементы.ФормаДалее.Видимость = СтраницаШаговАктивна;
	Элементы.ФормаВыбратьДругойДень.Видимость = СтраницаШаговАктивна;
	Элементы.ФормаПерезагрузитьЧекиЗаДень.Видимость = СтраницаШаговАктивна
		И (ТекущаяСтраницаШага = Элементы.СтраницаСопоставления
			ИЛИ ТекущаяСтраницаШага = Элементы.СтраницаСверка);

КонецПроцедуры

// Переводит форму со страницы параметров на первый рабочий шаг.
//
&НаКлиенте
Процедура ПерейтиКШагамРаботы()

	ИнициализироватьСтатусыШаговНаСервере();

	Элементы.ГруппаОсновная.ТекущаяСтраница = Элементы.СтраницаШагов;
	Элементы.ГруппаШагов.ТекущаяСтраница = Элементы.СтраницаСопоставления;

	ОбновитьВидимостьТекущегоСклада();
	ОбновитьВидимостьКомандФормы();
	ОбновитьСтатусТекущегоШага();

КонецПроцедуры

// Возвращает массив складов сессии на клиенте.
//
&НаСервере
Функция ПолучитьМассивСкладовСессииНаКлиенте()

	Возврат ПолучитьМассивСкладовСессии();

КонецФункции

// Управляет видимостью надписей «все чисто» на страницах шагов.
//
&НаКлиенте
Процедура ОбновитьВидимостьНадписейВсеЧисто()

	Элементы.НадписьВсеЧистоСопоставление.Видимость = НесопоставленныеОбъекты.Количество() = 0;
	Элементы.НадписьВсеЧистоСверка.Видимость = ОтклоненияСверки.Количество() = 0;
	Элементы.НадписьВсеЧистоФормирование.Видимость =
		ОтклоненияВыпуска.Количество() = 0
		И ОшибкиФормирования.Количество() = 0
		И ДокументыОткрытыеЦены.Количество() = 0;
	Элементы.НадписьВсеЧистоОстатки.Видимость = ОтрицательныеОстатки.Количество() = 0;

КонецПроцедуры

// Ожидает завершения одной длительной операции.
//
&НаКлиенте
Процедура ОжидатьДлительнуюОперацию(ДлительнаяОперация, ТекстОжидания, ИмяОбработчика)

	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = ТекстОжидания;

	Оповещение = Новый ОписаниеОповещения(ИмяОбработчика, ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);

КонецПроцедуры

// Ожидает завершения нескольких длительных операций последовательно.
//
&НаКлиенте
Процедура ОжидатьДлительныеОперации(ДлительныеОперации, ТекстОжидания, ИмяОбработчика)

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Операции", ДлительныеОперации);
	ДополнительныеПараметры.Вставить("Индекс", 0);
	ДополнительныеПараметры.Вставить("ТекстОжидания", ТекстОжидания);
	ДополнительныеПараметры.Вставить("ИмяОбработчика", ИмяОбработчика);

	ОжидатьСледующуюДлительнуюОперацию(Неопределено, ДополнительныеПараметры);

КонецПроцедуры

// Обработчик цепочки ожидания длительных операций.
//
&НаКлиенте
Процедура ОжидатьСледующуюДлительнуюОперацию(Результат, ДополнительныеПараметры) Экспорт

	Индекс = ДополнительныеПараметры.Индекс;
	Операции = ДополнительныеПараметры.Операции;

	Если Индекс >= Операции.Количество() Тогда
		ИмяОбработчика = ДополнительныеПараметры.ИмяОбработчика;
		Оповещение = Новый ОписаниеОповещения(ИмяОбработчика, ЭтотОбъект);
		ВыполнитьОбработкуОповещения(Оповещение, Неопределено);
		Возврат;
	КонецЕсли;

	ДополнительныеПараметры.Индекс = Индекс + 1;

	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = ДополнительныеПараметры.ТекстОжидания;

	Оповещение = Новый ОписаниеОповещения("ОжидатьСледующуюДлительнуюОперацию", ЭтотОбъект, ДополнительныеПараметры);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Операции[Индекс], Оповещение, ПараметрыОжидания);

КонецПроцедуры

// Обработчик завершения старта работы.
//
&НаКлиенте
Процедура ПослеНачалаРаботы(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтатусОперации = "";
	Если Результат.Свойство("Статус", СтатусОперации) И СтатусОперации = "Ошибка" Тогда
		Возврат;
	КонецЕсли;

	ПрименитьРекомендуемыйДеньНаСервере();
	ПерейтиКШагамРаботы();

КонецПроцедуры

// Обработчик завершения фонового обновления статуса шага.
//
&НаКлиенте
Процедура ПослеОбновленияСтатусаТекущегоШага(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СтатусОперации = "";
	Если Результат.Свойство("Статус", СтатусОперации) И СтатусОперации = "Ошибка" Тогда
		Возврат;
	КонецЕсли;

	НуженДиалог = ПрименитьРезультатСтатусаНаСервере();
	ОбновитьВидимостьНадписейВсеЧисто();

	Если НуженДиалог Тогда
		ПоказатьДиалогАктуальности();
	КонецЕсли;

КонецПроцедуры

// Обработчик завершения перезагрузки чеков.
//
&НаКлиенте
Процедура ПослеПерезагрузкиЧеков(Результат, ДополнительныеПараметры) Экспорт

	ОбновитьСтатусТекущегоШага();

КонецПроцедуры

// Обработчик завершения переформирования выпусков.
//
&НаКлиенте
Процедура ПослеПереформированияВыпусков(Результат, ДополнительныеПараметры) Экспорт

	ОбработатьРезультатФормированияНаСервере();
	ОбновитьСтатусТекущегоШага();

КонецПроцедуры

// Обработчик завершения сопоставления.
//
&НаКлиенте
Процедура ПослеСопоставления(Результат, ДополнительныеПараметры) Экспорт

	ОбновитьСтатусТекущегоШага();

КонецПроцедуры

// Обработчик завершения расчета рекомендуемого дня.
//
&НаКлиенте
Процедура ПослеРасчетаРекомендуемогоДня(Результат, ДополнительныеПараметры) Экспорт

	ПрименитьРекомендуемыйДеньНаСервере();

КонецПроцедуры

// Сохраняет адрес результата формирования и показывает сообщения об ошибках.
//
&НаСервере
Процедура ОбработатьРезультатФормированияНаСервере()

	Если НЕ ЗначениеЗаполнено(АдресРезультатаФормирования) Тогда
		Возврат;
	КонецЕсли;

	Результат = ПолучитьИзВременногоХранилища(АдресРезультатаФормирования);

	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	Если Результат.Свойство("СообщенияОбОшибках") И ЗначениеЗаполнено(Результат.СообщенияОбОшибках) Тогда
		ОбщегоНазначения.СообщитьПользователю(Результат.СообщенияОбОшибках);
	КонецЕсли;

КонецПроцедуры

// Читает рассчитанный рекомендуемый день из временного хранилища.
//
&НаСервере
Процедура ПрименитьРекомендуемыйДеньНаСервере()

	Если НЕ ЗначениеЗаполнено(АдресРезультатаРекомендуемогоДня) Тогда
		Возврат;
	КонецЕсли;

	РекомендуемыйДень = ПолучитьИзВременногоХранилища(АдресРезультатаРекомендуемогоДня);

КонецПроцедуры

#КонецОбласти
